
CAREERS = {
    "python": {
        "title": "💻 Python-разработчик",
        "description": (
            "Создаёт программы, Telegram-ботов "
            "и приложения."
        ),
        "pros": "Python применяется во многих областях.",
        "cons": "Нужно учиться решать задачи и исправлять ошибки."
    },
    "games": {
        "title": "🎮 Разработчик игр",
        "description": (
            "Создаёт игровые механики, уровни "
            "и логику игр."
        ),
        "pros": "Можно создавать собственные игры.",
        "cons": "Разработка сложных игр требует времени."
    },
    "qa": {
        "title": "🧪 Тестировщик программ",
        "description": (
            "Проверяет программы и помогает находить ошибки."
        ),
        "pros": "Можно начать с ручного тестирования.",
        "cons": "Нужно внимательно проверять разные сценарии."
    }
}


def get_career_text(career_id):
    career = CAREERS.get(career_id)

    if not career:
        return "Информация об этой профессии пока недоступна."

    return (
        f"{career['title']}\n\n"
        f"📌 Чем занимается:\n{career['description']}\n\n"
        f"✅ Плюс:\n{career['pros']}\n\n"
        f"⚠️ Что может быть сложно:\n{career['cons']}"
    )
